a = 17/2*3+2
a_1 = ((17/2)*3)+2
print('Результат выражения 17/2*3+2 = ', a)
print('Результат выражения ((17/2)*3)+2 = ', a_1)
if a == a_1: 
    print('Результаты выражений равны')
elif a != a_1:
    print('Результаты выражений не равны')    

b = 2+17/2*3
b_1 = 2+((17/2)*3)_
print('Результат выражения 2+17/2*3 = ', b)
print('Результат выражения 2+((17/2)*3) = ', b_1)
if b == b_1: 
    print('Результаты выражений равны')
elif b != b_1:
    print('Результаты выражений не равны')

c = 19%4+15/2*3
c_1 = (19%4)+((15/2)*3)
print('Результат выражения 19%4+15/2*3 = ', c)
print('Результат выражения (19%4)+((15/2)*3) = ', c_1)
if c == c_1: 
    print('Результаты выражений равны')
elif c != c_1:
    print('Результаты выражений не равны')


d = (15+6)-10*4
d_1 = (15+6)-(10*4)
print('Результат выражения (15+6)-10*4 = ', d)
print('Результат выражения (15+6)-(10*4) = ', d_1)
if d == d_1: 
    print('Результаты выражений равны')
elif d != d_1:
    print('Результаты выражений не равны')

e = 17/2%2*3**3
e_1 = ((17/2)%2)*(3**3)
print('Результат выражения 17/2%2*3**3 = ', e)
print('Результат выражения ((17/2)%2)*(3**3) = ', e_1)
if e == e_1: 
    print('Результаты выражений равны')
elif e != e_1:
    print('Результаты выражений не равны')

