#1. Создать 3 переменные с одинаковыми данными и с одинаковыми идентификаторами
a = 3
b = a
c = b
print ( a , id(a) ,
'\n' , b ,id(b) , 
'\n' , c , id(c))
