# Создать две переменные с одинаковыми данными и разными идентификаторами
a = [4,5,6]
b = [4,5,6]
print (' a == b ' , a == b,
'\n id(a) is id(b) ', id(a) is id(b))
