"""
5. *Прочитать сохраненный csv-файл и сохранить данные в excel-файл, кроме возраста -
столбец с этими данными не нужен. Таблица должна выглядеть, как на примере:
----------------------------------------
       | Person 1 | Person 2 | Person 3
----------------------------------------
id     | 111111   | 222043   | 679432
----------------------------------------
name   |   Sam    |   Adam   |   Jasy
----------------------------------------
phone  | 097-32-88| 090-45-41| 094-66-22
----------------------------------------
"""